app/views/meetings/_form.html.erb

SELECT "patients"."id", "patients"."name" FROM "patients"
---
      <%= form.label "patient-ID" %>
      <%= form.grouped_collection_select :patient_id,User.with_any_role(:admin,:doctor),:patients,:email,:id,:name,{include_blank: true},{class: 'form-control'}%>