app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
    @search= current_user.meetings.search(params[:q])
    if @search.result
      @meetings=@search.result.paginate(:page => params[:page],:per_page => 3)
---
SELECT "meetings".* FROM "meetings"
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "meetings" WHERE "meetings"."user_id" = $1  [["user_id", 1]]

  def new
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def create
    @meeting = Meeting.new(meeting_params)
    @meeting.user_id=current_user.id
      if @meeting.save
---
INSERT INTO "meetings" ("name", "start_time", "end_time", "user_id", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 4]]

    def set_meeting
      @meeting = Meeting.find(params[:id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]