app/controllers/patients_controller.rb

	def index
		@search= current_user.patients.search(params[:q])
		if @search.result
			@patients=@search.result.paginate(:page => params[:page],:per_page => 4)
---
SELECT  "patients".* FROM "patients" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT  "patients".* FROM "patients" WHERE "patients"."user_id" = $1 ORDER BY "patients"."id" DESC LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "patients" WHERE "patients"."user_id" = $1  [["user_id", 1]]

	def new
		@user_patient=current_user.patients.all
---
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = $1  [["user_id", 2]]

	def create
		@patient=current_user.patients.new(patient_params)
      if @patient.save
---
INSERT INTO "patients" ("name", "age", "email", "address", "details", "date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

	def destroy
		@patient=Patient.destroy(params[:id])
---
DELETE FROM "patients" WHERE "patients"."id" = $1  [["id", 1]]

	def update
		@patient = Patient.find(params[:id])
		respond_to do |format|
      if @patient.update(patient_params)
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "patients" SET "name" = $1, "updated_at" = $2 WHERE "patients"."id" = $3  [["name", "Sasidhar"], ["updated_at", "2020-06-19 05:57:16.971495"], ["id", 15]]

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]